---
kind: property
id: P:Autodesk.Revit.DB.ImageExportOptions.ImageResolution
source: html/4dd2bc52-4ece-d7e8-cb96-c2ebc645fb5d.htm
---
# Autodesk.Revit.DB.ImageExportOptions.ImageResolution Property

The image resolution in dots per inch.

## Syntax (C#)
```csharp
public ImageResolution ImageResolution { get; set; }
```

## Remarks
The default is DPI_72.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration